results-homelab-colocated/output_homelab_colocate_3vm_gemfire_macbook-10000_2t_run.txt
/Library/Java/JavaVirtualMachines/adoptopenjdk-8.jdk/Contents/Home/bin/java  -classpath /Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/conf:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -t -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -t -db site.ycsb.db.GeodeClient -P ../YCSB-geode-custom/workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] recordcount:10000
[INFO] threadcount:2
[INFO] operationcount:10000
[INFO] readproportion:0.5
[INFO] updateproportion:0.5
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-04-20 23:41:43:034 0 sec: 0 operations; est completion in 0 second 
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
[DEBUG] GeodeClient.java addPoolLocator:4c5fec0a-a29e-461a-a8a4-c9c6af900194.locator-server.network.service-instance-1d8cf652-27f5-4220-a04f-1cadb69b08fe.bosh:55221
[DEBUG] GeodeClient.java addPoolLocator:4c5fec0a-a29e-461a-a8a4-c9c6af900194.locator-server.network.service-instance-1d8cf652-27f5-4220-a04f-1cadb69b08fe.bosh:55221
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Exception in thread "Thread-4" java.lang.IllegalStateException: A connection to a distributed system already exists in this VM.  It has the following configuration:  ack-severe-alert-threshold="0"
  ack-wait-threshold="15"
  archive-disk-space-limit="0"
  archive-file-size-limit="0"
  async-distribution-timeout="0"
  async-max-queue-size="8"
  async-queue-timeout="60000"
  bind-address=""
  cache-xml-file="cache.xml"
  cluster-configuration-dir=""
  cluster-ssl-ciphers="any"
  cluster-ssl-enabled="true"
  cluster-ssl-keystore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/keystore.jks"
  cluster-ssl-keystore-password="rF0zsdaFyDNFxE6aFy1w0fmtGmYV76"
  cluster-ssl-keystore-type="JKS"
  cluster-ssl-protocols="any"
  cluster-ssl-require-authentication="false"
  cluster-ssl-truststore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/truststore.jks"
  cluster-ssl-truststore-password="2dF0Tt3ntVmXtbCZMu361wfgilQOVE"
  conflate-events="server"
  conserve-sockets="false"
  delta-propagation="true"
  deploy-working-dir="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi"
  disable-auto-reconnect="false"
  disable-jmx="false"
  disable-tcp="false"
  distributed-system-id="-1"
  distributed-transactions="false"
  durable-client-id=""
  durable-client-timeout="300"
  enable-cluster-configuration="true"
  enable-management-rest-service="true"
  enable-network-partition-detection="true"
  enable-time-statistics="true"
  enforce-unique-host="false"
  gateway-ssl-ciphers="any"
  gateway-ssl-enabled="true"
  gateway-ssl-keystore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/keystore.jks"
  gateway-ssl-keystore-password="rF0zsdaFyDNFxE6aFy1w0fmtGmYV76"
  gateway-ssl-keystore-type="JKS"
  gateway-ssl-protocols="any"
  gateway-ssl-require-authentication="false"
  gateway-ssl-truststore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/truststore.jks"
  gateway-ssl-truststore-password="2dF0Tt3ntVmXtbCZMu361wfgilQOVE"
  groups=""
  http-service-bind-address=""
  http-service-port="7070"
  http-service-ssl-ciphers="any"
  http-service-ssl-enabled="true"
  http-service-ssl-keystore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/keystore.jks"
  http-service-ssl-keystore-password="rF0zsdaFyDNFxE6aFy1w0fmtGmYV76"
  http-service-ssl-keystore-type="JKS"
  http-service-ssl-protocols="any"
  http-service-ssl-require-authentication="false"
  http-service-ssl-truststore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/truststore.jks"
  http-service-ssl-truststore-password="2dF0Tt3ntVmXtbCZMu361wfgilQOVE"
  jmx-manager="false"
  jmx-manager-access-file=""
  jmx-manager-bind-address=""
  jmx-manager-hostname-for-clients=""
  jmx-manager-http-port="7070"
  jmx-manager-password-file=""
  jmx-manager-port="1099"
  jmx-manager-ssl-ciphers="any"
  jmx-manager-ssl-enabled="true"
  jmx-manager-ssl-keystore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/keystore.jks"
  jmx-manager-ssl-keystore-password="rF0zsdaFyDNFxE6aFy1w0fmtGmYV76"
  jmx-manager-ssl-keystore-type="JKS"
  jmx-manager-ssl-protocols="any"
  jmx-manager-ssl-require-authentication="false"
  jmx-manager-ssl-truststore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/truststore.jks"
  jmx-manager-ssl-truststore-password="2dF0Tt3ntVmXtbCZMu361wfgilQOVE"
  jmx-manager-start="false"
  jmx-manager-update-rate="2000"
  load-cluster-configuration-from-dir="false"
  locator-wait-time="0"
  locators=""
  lock-memory="false"
  log-disk-space-limit="0"
  log-file=""
  log-file-size-limit="0"
  log-level="config"
  max-num-reconnect-tries="3"
  max-wait-time-reconnect="60000"
  mcast-address="239.192.81.1/239.192.81.1"
  mcast-flow-control="1048576, 0.25, 5000"
  mcast-port="0"
  mcast-recv-buffer-size="1048576"
  mcast-send-buffer-size="65535"
  mcast-ttl="32"
  member-timeout="5000"
  membership-port-range="[41000,61000]"
  memcached-bind-address=""
  memcached-port="0"
  memcached-protocol="ASCII"
  name=""
  off-heap-memory-size=""
  redundancy-zone=""
  remote-locators=""
  remove-unresponsive-client="false"
  roles=""
  security-auth-token-enabled-components="[]"
  security-client-accessor=""
  security-client-accessor-pp=""
  security-client-auth-init="site.ycsb.db.UserPasswordAuthInit"
  security-client-authenticator=""
  security-client-dhalgo=""
  security-log-file=""
  security-log-level="config"
  security-manager=""
  security-peer-auth-init=""
  security-peer-authenticator=""
  security-peer-verifymember-timeout="1000"
  security-post-processor=""
  security-shiro-init=""
  security-udp-dhalgo=""
  serializable-object-filter="!*"
  server-bind-address=""
  server-ssl-ciphers="any"
  server-ssl-enabled="true"
  server-ssl-keystore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/keystore.jks"
  server-ssl-keystore-password="rF0zsdaFyDNFxE6aFy1w0fmtGmYV76"
  server-ssl-keystore-type="JKS"
  server-ssl-protocols="any"
  server-ssl-require-authentication="false"
  server-ssl-truststore="/Users/kminseok/_dev/tanzu-main/gemfire-performance-testing/config-homelab-multi/truststore.jks"
  server-ssl-truststore-password="2dF0Tt3ntVmXtbCZMu361wfgilQOVE"
  socket-buffer-size="32768"
  socket-lease-time="1800000"
  ssl-ciphers="any"
  ssl-client-protocols=""
  ssl-cluster-alias=""
  ssl-default-alias=""
  ssl-enabled-components="[]"
  ssl-endpoint-identification-enabled="false"
  ssl-gateway-alias=""
  ssl-jmx-alias=""
  ssl-keystore=""
  ssl-keystore-password=""
  ssl-keystore-type=""
  ssl-locator-alias=""
  ssl-parameter-extension=""
  ssl-protocols="any"
  ssl-require-authentication="true"
  ssl-server-alias=""
  ssl-server-protocols=""
  ssl-truststore=""
  ssl-truststore-password=""
  ssl-truststore-type=""
  ssl-use-default-context="false"
  ssl-web-alias=""
  ssl-web-require-authentication="false"
  start-dev-rest-api="false"
  start-locator=""
  statistic-archive-file=""
  statistic-sample-rate="1000"
  statistic-sampling-enabled="true"
  tcp-port="0"
  thread-monitor-enabled="true"
  thread-monitor-interval-ms="60000"
  thread-monitor-time-limit-ms="120000"
  udp-fragment-size="60000"
  udp-recv-buffer-size="1048576"
  udp-send-buffer-size="65535"
  use-cluster-configuration="true"
  use-udp-membership-messenger="false"
  user-command-packages=""
  validate-serializable-objects="false"

	at org.apache.geode.distributed.internal.InternalDistributedSystem.validateSameProperties(InternalDistributedSystem.java:2807)
	at org.apache.geode.distributed.internal.InternalDistributedSystem.connectInternal(InternalDistributedSystem.java:276)
	at org.apache.geode.distributed.internal.InternalDistributedSystem.connectInternal(InternalDistributedSystem.java:215)
	at org.apache.geode.cache.client.ClientCacheFactory.connectInternalDistributedSystem(ClientCacheFactory.java:285)
	at org.apache.geode.cache.client.ClientCacheFactory.basicCreate(ClientCacheFactory.java:255)
	at org.apache.geode.cache.client.ClientCacheFactory.create(ClientCacheFactory.java:222)
	at site.ycsb.db.GeodeClient.init(GeodeClient.java:184)
	at site.ycsb.DBWrapper.init(DBWrapper.java:90)
	at site.ycsb.ClientThread.run(ClientThread.java:91)
	at java.lang.Thread.run(Thread.java:748)
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
## UserPasswordAuthInit security-username:cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-20 23:41:53:004 10 sec: 1151 operations; 115.04 current ops/sec; est completion in 1 minute [READ: Count=400, Max=21103, Min=2698, Avg=5986.16, 90=9135, 99=14999, 99.9=21103, 99.99=21103] [UPDATE: Count=580, Max=903167, Min=2972, Avg=8265.87, 90=10343, 99=26031, 99.9=121151, 99.99=903167] [READ-FAILED: Count=177, Max=57855, Min=2706, Avg=6173.14, 90=8679, 99=18063, 99.9=57855, 99.99=57855] 
2024-04-20 23:42:03:001 20 sec: 3219 operations; 206.8 current ops/sec; est completion in 43 seconds [READ: Count=751, Max=21375, Min=2534, Avg=4790.93, 90=7019, 99=12647, 99.9=15223, 99.99=21375] [UPDATE: Count=1042, Max=27951, Min=2512, Avg=4791.27, 90=6947, 99=13167, 99.9=24127, 99.99=27951] [READ-FAILED: Count=270, Max=12671, Min=2688, Avg=4555.41, 90=6903, 99=10783, 99.9=12671, 99.99=12671] 
2024-04-20 23:42:11:488 28 sec: 5000 operations; 209.85 current ops/sec; est completion in 29 seconds [READ: Count=639, Max=19583, Min=2264, Avg=4709.08, 90=7071, 99=12559, 99.9=17743, 99.99=19583] [CLEANUP: Count=1, Max=13, Min=13, Avg=13, 90=13, 99=13, 99.9=13, 99.99=13] [UPDATE: Count=906, Max=39455, Min=2280, Avg=4750.23, 90=7047, 99=11975, 99.9=32719, 99.99=39455] [READ-FAILED: Count=235, Max=12911, Min=2248, Avg=4365.83, 90=6635, 99=9839, 99.9=12911, 99.99=12911] 
[OVERALL], RunTime(ms), 28493
[OVERALL], Throughput(ops/sec), 175.48169725897588
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 25
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.08774084862948794
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 19
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.06668304495841085
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 44
[TOTAL_GC_TIME_%], Time(%), 0.1544238935878988
[READ], Operations, 1790
[READ], AverageLatency(us), 5028.8027932960895
[READ], MinLatency(us), 2264
[READ], MaxLatency(us), 21375
[READ], 95thPercentileLatency(us), 9511
[READ], 99thPercentileLatency(us), 13647
[READ], Return=OK, 1790
[READ], Return=ERROR, 682
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 13.0
[CLEANUP], MinLatency(us), 13
[CLEANUP], MaxLatency(us), 13
[CLEANUP], 95thPercentileLatency(us), 13
[CLEANUP], 99thPercentileLatency(us), 13
[UPDATE], Operations, 2528
[UPDATE], AverageLatency(us), 5573.737341772152
[UPDATE], MinLatency(us), 2280
[UPDATE], MaxLatency(us), 903167
[UPDATE], 95thPercentileLatency(us), 9767
[UPDATE], 99thPercentileLatency(us), 16399
[UPDATE], Return=OK, 2528
[READ-FAILED], Operations, 682
[READ-FAILED], AverageLatency(us), 4909.935483870968
[READ-FAILED], MinLatency(us), 2248
[READ-FAILED], MaxLatency(us), 57855
[READ-FAILED], 95thPercentileLatency(us), 8383
[READ-FAILED], 99thPercentileLatency(us), 12671